app/controllers/posts_controller.rb

  def top
    @todo = []
    @done = []
    posts = Post.all.order(created_at: :desc)
    posts.each do |post|
---
SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC

  def edit
    @post = Post.find_by(id: params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    post = Post.new(kind:0, name:params[:name], content:params[:content])
    post.save
---
INSERT INTO "posts" ("kind", "name", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["kind", 0], ["name", "Lickey"], ["content", "おはよう"], ["created_at", "2018-07-20 21:55:39.042108"], ["updated_at", "2018-07-20 21:55:39.042108"]]

  def rewrite
    post = Post.find_by(id: params[:id])
    post.name = params[:name]
    post.content = params[:content]
    post.save
    result = post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "こんにちは"], ["updated_at", "2018-07-20 21:55:47.591424"], ["id", 5]]
UPDATE "posts" SET "kind" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["kind", 1], ["updated_at", "2018-07-20 21:07:24.321607"], ["id", 4]]

  def move
    post = Post.find_by(id: params[:id])
    if post.kind == 0 then
      post.kind = 1
    else
      post.kind = 0
    end
    result = post.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "kind" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["kind", 1], ["updated_at", "2018-07-20 21:49:20.824762"], ["id", 4]]